spec/support/vcr_cassettes/claims_api/bgs/intent_to_file_web_service/get_intent_to_file.yml

---
http_interactions:
- request:
    method: get
    uri: <BGS_BASE_URL>/IntentToFileWebServiceBean/IntentToFileWebService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - linktest.vba.va.gov
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 10 Aug 2020 21:28:36 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-b170407.2038 svn-revision#2eaca54d17a59d265c6fe886b7fd0027836c766c. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://intenttofile.services.vetsnet.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://intenttofile.services.vetsnet.vba.va.gov/" name="IntentToFileWebService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://intenttofile.services.vetsnet.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/IntentToFileWebServiceBean/IntentToFileWebService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="findIntentToFileByPtcpntIdItfTypeCdBnftClaimId">
        <part name="parameters" element="tns:findIntentToFileByPtcpntIdItfTypeCdBnftClaimId"/>
        </message>
        <message name="findIntentToFileByPtcpntIdItfTypeCdBnftClaimIdResponse">
        <part name="parameters" element="tns:findIntentToFileByPtcpntIdItfTypeCdBnftClaimIdResponse"/>
        </message>
        <message name="MessageException">
        <part name="fault" element="tns:MessageException"/>
        </message>
        <message name="findIntentToFileByPtcpntId">
        <part name="parameters" element="tns:findIntentToFileByPtcpntId"/>
        </message>
        <message name="findIntentToFileByPtcpntIdResponse">
        <part name="parameters" element="tns:findIntentToFileByPtcpntIdResponse"/>
        </message>
        <message name="findIntentToFileByPtcpntIdItfTypeCd">
        <part name="parameters" element="tns:findIntentToFileByPtcpntIdItfTypeCd"/>
        </message>
        <message name="findIntentToFileByPtcpntIdItfTypeCdResponse">
        <part name="parameters" element="tns:findIntentToFileByPtcpntIdItfTypeCdResponse"/>
        </message>
        <message name="insertIntentToFile">
        <part name="parameters" element="tns:insertIntentToFile"/>
        </message>
        <message name="insertIntentToFileResponse">
        <part name="parameters" element="tns:insertIntentToFileResponse"/>
        </message>
        <message name="updateIntentToFile">
        <part name="parameters" element="tns:updateIntentToFile"/>
        </message>
        <message name="updateIntentToFileResponse">
        <part name="parameters" element="tns:updateIntentToFileResponse"/>
        </message>
        <portType name="IntentToFileWebService">
        <operation name="findIntentToFileByPtcpntIdItfTypeCdBnftClaimId">
        <input wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCdBnftClaimIdRequest" message="tns:findIntentToFileByPtcpntIdItfTypeCdBnftClaimId"/>
        <output wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCdBnftClaimIdResponse" message="tns:findIntentToFileByPtcpntIdItfTypeCdBnftClaimIdResponse"/>
        <fault message="tns:MessageException" name="MessageException" wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCdBnftClaimId/Fault/MessageException"/>
        </operation>
        <operation name="findIntentToFileByPtcpntId">
        <input wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdRequest" message="tns:findIntentToFileByPtcpntId"/>
        <output wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdResponse" message="tns:findIntentToFileByPtcpntIdResponse"/>
        <fault message="tns:MessageException" name="MessageException" wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntId/Fault/MessageException"/>
        </operation>
        <operation name="findIntentToFileByPtcpntIdItfTypeCd">
        <input wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCdRequest" message="tns:findIntentToFileByPtcpntIdItfTypeCd"/>
        <output wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCdResponse" message="tns:findIntentToFileByPtcpntIdItfTypeCdResponse"/>
        <fault message="tns:MessageException" name="MessageException" wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/findIntentToFileByPtcpntIdItfTypeCd/Fault/MessageException"/>
        </operation>
        <operation name="insertIntentToFile">
        <input wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/insertIntentToFileRequest" message="tns:insertIntentToFile"/>
        <output wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/insertIntentToFileResponse" message="tns:insertIntentToFileResponse"/>
        <fault message="tns:MessageException" name="MessageException" wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/insertIntentToFile/Fault/MessageException"/>
        </operation>
        <operation name="updateIntentToFile">
        <input wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/updateIntentToFileRequest" message="tns:updateIntentToFile"/>
        <output wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/updateIntentToFileResponse" message="tns:updateIntentToFileResponse"/>
        <fault message="tns:MessageException" name="MessageException" wsam:Action="http://intenttofile.services.vetsnet.vba.va.gov/IntentToFileWebService/updateIntentToFile/Fault/MessageException"/>
        </operation>
        </portType>
        <binding name="IntentToFileWebServicePortBinding" type="tns:IntentToFileWebService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="findIntentToFileByPtcpntIdItfTypeCdBnftClaimId">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageException">
        <soap:fault name="MessageException" use="literal"/>
        </fault>
        </operation>
        <operation name="findIntentToFileByPtcpntId">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageException">
        <soap:fault name="MessageException" use="literal"/>
        </fault>
        </operation>
        <operation name="findIntentToFileByPtcpntIdItfTypeCd">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageException">
        <soap:fault name="MessageException" use="literal"/>
        </fault>
        </operation>
        <operation name="insertIntentToFile">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageException">
        <soap:fault name="MessageException" use="literal"/>
        </fault>
        </operation>
        <operation name="updateIntentToFile">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageException">
        <soap:fault name="MessageException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="IntentToFileWebService">
        <port name="IntentToFileWebServicePort" binding="tns:IntentToFileWebServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/IntentToFileWebServiceBean/IntentToFileWebService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Mon, 10 Aug 2020 21:28:36 GMT
- request:
    method: post
    uri: <BGS_BASE_URL>/IntentToFileWebServiceBean/IntentToFileWebService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://intenttofile.services.vetsnet.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>192.168.4.22</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>2802154032</vaws:ExternalUid>
            <vaws:ExternalKey>2802154032</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:findIntentToFileByPtcpntIdItfTypeCd><ptcpntId>13367440</ptcpntId><itfTypeCd>C</itfTypeCd></tns:findIntentToFileByPtcpntIdItfTypeCd></env:Body></env:Envelope>
    headers:
      Host:
      - linktest.vba.va.gov
      Soapaction:
      - '"findIntentToFileByPtcpntIdItfTypeCd"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1044'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 10 Aug 2020 21:28:37 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdWAB13ZWJsb2dpYy5hcHAuQ29ycG9yYXRlRGF0YUVBUgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQACDMuMS4xOC4wAAA=</work:WorkContext></env:Header><S:Body><ns0:findIntentToFileByPtcpntIdItfTypeCdResponse
        xmlns:ns0="http://intenttofile.services.vetsnet.vba.va.gov/"><IntentToFileDTO><createDt>2020-06-05T11:24:28-05:00</createDt><exprtnDt>2021-06-05T11:24:28-05:00</exprtnDt><intentToFileId>183042</intentToFileId><itfStatusTypeCd>Active</itfStatusTypeCd><itfTypeCd>C</itfTypeCd><jrnDt>2020-06-05T11:24:28-05:00</jrnDt><jrnExtnlKeyTxt>dslogon.1013590059</jrnExtnlKeyTxt><jrnExtnlUserId>dslogon.1013590059</jrnExtnlUserId><jrnLctnId>281</jrnLctnId><jrnObjId>eBenefits</jrnObjId><jrnStatusTypeCd>I</jrnStatusTypeCd><jrnUserId>VAEBENEFITS</jrnUserId><ptcpntClmantId>13367440</ptcpntClmantId><ptcpntVetId>13367440</ptcpntVetId><rcvdDt>2020-06-05T11:24:28-05:00</rcvdDt><statusDt>2020-06-05T11:24:28-05:00</statusDt><submtrApplcnTypeCd>VETS.GOV</submtrApplcnTypeCd></IntentToFileDTO><IntentToFileDTO><exprtnDt>2021-08-04T11:11:14-05:00</exprtnDt><intentToFileId>184000</intentToFileId><itfStatusTypeCd>Active</itfStatusTypeCd><itfTypeCd>C</itfTypeCd><jrnDt>2020-08-05T18:57:49-05:00</jrnDt><jrnExtnlKeyTxt>something</jrnExtnlKeyTxt><jrnExtnlUserId>something</jrnExtnlUserId><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><ptcpntClmantId>13367440</ptcpntClmantId><ptcpntVetId>13367440</ptcpntVetId><rcvdDt>2020-08-04T11:11:14-05:00</rcvdDt><statusDt>2020-08-05T18:57:49-05:00</statusDt><submtrApplcnTypeCd>VETS.GOV</submtrApplcnTypeCd></IntentToFileDTO></ns0:findIntentToFileByPtcpntIdItfTypeCdResponse></S:Body></S:Envelope>
  recorded_at: Mon, 10 Aug 2020 21:28:37 GMT
recorded_with: VCR 6.0.0
