spec/support/vcr_cassettes/claims_api/bgs/intent_to_file_web_service/find_intent_to_file_by_ptcpnt_id_itf_type_cd.yml

---
http_interactions:
- request:
    method: post
    uri: "<BGS_BASE_URL>/IntentToFileWebServiceBean/IntentToFileWebService"
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://intenttofile.services.vetsnet.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>127.0.0.1</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:findIntentToFileByPtcpntIdItfTypeCd><ptcpntId>600061742</ptcpntId><itfTypeCd>C</itfTypeCd>
        </tns:findIntentToFileByPtcpntIdItfTypeCd>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - "<FARADAY_VERSION>"
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"findIntentToFileByPtcpntIdItfTypeCd"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 16 Jan 2025 16:08:36 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdTAB13ZWJsb2dpYy5hcHAuQ29ycG9yYXRlRGF0YUVBUgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTMuNS4yAAA=</work:WorkContext></env:Header><S:Body><ns0:findIntentToFileByPtcpntIdItfTypeCdResponse
        xmlns:ns0="http://intenttofile.services.vetsnet.vba.va.gov/"><IntentToFileDTO><createDt>2024-11-12T09:59:30-06:00</createDt><exprtnDt>2025-11-12T09:59:29-06:00</exprtnDt><intentToFileId>287002</intentToFileId><itfStatusTypeCd>Active</itfStatusTypeCd><itfTypeCd>C</itfTypeCd><jrnDt>2024-11-12T09:59:30-06:00</jrnDt><jrnExtnlKeyTxt>piv.beatrice.stroud44.va.gov</jrnExtnlKeyTxt><jrnExtnlUserId>piv.beatrice.stroud44.va.gov</jrnExtnlUserId><jrnLctnId>281</jrnLctnId><jrnObjId>eBenefits</jrnObjId><jrnStatusTypeCd>I</jrnStatusTypeCd><jrnUserId>VAEBENEFITS</jrnUserId><ptcpntClmantId>600061742</ptcpntClmantId><ptcpntVetId>600061742</ptcpntVetId><rcvdDt>2024-11-12T09:59:29-06:00</rcvdDt><statusDt>2024-11-12T09:59:30-06:00</statusDt><submtrApplcnTypeCd>SEP</submtrApplcnTypeCd></IntentToFileDTO></ns0:findIntentToFileByPtcpntIdItfTypeCdResponse></S:Body></S:Envelope>
  recorded_at: Thu, 16 Jan 2025 16:08:36 GMT
recorded_with: VCR 6.3.1
